{
  "title": "Online DevOps Dojo",
  "description": "Learning DevOps, for real.  DXC Technology has long embraced the importance of DevOps. We have used multiple Katacoda scenarii to help transform our workforce at scale. We now want via the Online DevOps Dojo to contribute something to the community from whom we have learnt so much.",
  "courses": [
    {
      "title": "Welcome",
      "description": "Getting started with the Online DevOps Dojo: understanding the back story, setting up your environment.",
      "course_id": "welcome"
    },
    {
      "title": "Leading Change",
      "description": "Learn about the importance of Leading Change in DevOps Transformations. A large factor in the success of DevOps transformations is driven by the organization's ability to empower people to lead change at the different levels in the organization.",
      "course_id": "leading-change"
    },
    {
      "title": "Version Control",
      "description": "Version control is a system that records changes to a file or set of files over time so that you can recall specific versions later.",
      "course_id": "version-control"
    },
    {
      "title": "Continuous Integration",
      "description": "The process of merging work from all the developers in a team into the master branch as and when required.",
      "course_id": "continuous-integration"
    },
    {
      "title": "Shift Left on Security",
      "description": "Security must be considered from the beginning and continuously assessed.",
      "course_id": "shift-security-left"
    },
    {
      "title": "Value Stream Mapping",
      "description": "Learn how Value Stream Mapping can be used to help you and your team optimize your processes for value delivery and speed.",
      "course_id": "value-stream-mapping"
    },
    {
      "title": "DevOps Kaizen",
      "description": "DevOps Kaizen events can be used to help you and your team continuously improve your development processes.",
      "course_id": "devops-kaizen"
    },
    {
      "title": "Post Incident Practices",
      "description": "Learn how to establish a Safety Culture, conduct blameless post-mortems and create a “code of conduct” to help your team manage incidents in all phases of their life cycle",
      "course_id": "post-incident-practices"
    }
  ]
}
